library("readr")
library("dplyr")
library("tidyr")

# Uvoz podatkov

eu15 <- read_csv("EURIBOR_2015.csv")
eu16 <- read_csv("EURIBOR_2016.csv")
eu17 <- read_csv("EURIBOR_2017.csv")

second <- eu15

# Čiščenje podatkov

eu15 <- eu15[, c("X1", "02/01/2015", "02/02/2015", "02/03/2015", "01/04/2015", "04/05/2015", "01/06/2015",
             "01/07/2015", "03/08/2015", "01/09/2015", "01/10/2015", "02/11/2015", "01/12/2015")]
eu16 <- eu16[, c("X1", "04/01/2016", "01/02/2016", "01/03/2016", "01/04/2016", "02/05/2016", "01/06/2016",
                 "01/07/2016", "01/08/2016", "01/09/2016", "03/10/2016", "01/11/2016", "01/12/2016")]
eu17 <- eu17[, c("X1", "02/01/2017", "01/02/2017", "01/03/2017", "03/04/2017", "02/05/2017", "01/06/2017",
                 "03/07/2017", "01/08/2017", "01/09/2017", "02/10/2017", "01/11/2017", "01/12/2017")]

eu15 <- t(eu15)
colnames(eu15) <- c("1w", "2w", "1m", "2m", "3m", "6m", "9m", "12m")
eu15 <- eu15[-1,]

eu16 <- t(eu16)
colnames(eu16) <- c("1w", "2w", "1m", "2m", "3m", "6m", "9m", "12m")
eu16 <- eu16[-1,]

eu17 <- t(eu17)
colnames(eu17) <- c("1w", "2w", "1m", "2m", "3m", "6m", "9m", "12m")
eu17 <- eu17[-1,]




#mesec = 1
#k = 1
#if (as.numeric(strsplit(colnames(eu15)[k]), split = "/") != mesec) {eu15 <- eu15[,-k]};
#if (as.numeric(strsplit(colnames(eu15)[k]), split = "/") == mesec) {mesec <- mesec + 1};
#k <- k+1;
#if (length(colnames(second)) <= 13) break